#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_compute_secgroup_v2.secgroup: Refreshing state... [id=47779555-2ce1-400c-ba68-d177683c7228]
openstack_networking_floatingip_v2.fip: Refreshing state... [id=1a2e1285-0a20-4582-aab9-27255607a862]
openstack_compute_instance_v2.dashboard: Refreshing state... [id=64417f02-61b5-4eb0-a9bd-a0f386a71d42]
openstack_compute_floatingip_associate_v2.fip: Refreshing state... [id=147.213.76.217/64417f02-61b5-4eb0-a9bd-a0f386a71d42/]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_floatingip_associate_v2.fip must be replaced
-/+ resource "openstack_compute_floatingip_associate_v2" "fip" {
      ~ id          = "147.213.76.217/64417f02-61b5-4eb0-a9bd-a0f386a71d42/" -> (known after apply)
      ~ instance_id = "64417f02-61b5-4eb0-a9bd-a0f386a71d42" -> (known after apply) # forces replacement
      + region      = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # openstack_compute_instance_v2.dashboard must be replaced
-/+ resource "openstack_compute_instance_v2" "dashboard" {
      ~ access_ip_v4        = "192.168.10.94" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ flavor_name         = "m1.medium" -> (known after apply)
      ~ id                  = "64417f02-61b5-4eb0-a9bd-a0f386a71d42" -> (known after apply)
      ~ image_name          = "Ubuntu-20.04-20211006" -> (known after apply)
        name                = "dashboard"
      + region              = (known after apply)
      - tags                = [] -> null
      ~ user_data           = "f81c59595cb3c50817fcba140058bde5fb303f9b" -> "f230185b5fed7ab7964da349467c65079c20f662" # forces replacement
        # (6 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.10.94" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:f7:a8:66" -> (known after apply)
          ~ name           = "private-network" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*